"use client";

import { createContext, useContext } from "react";

const methodData = [
  {
    id: "1",
    name: "",
    title: "وکیوم‌تراپی",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "2",
    name: "",
    title: " لیزر و نوردرمانی",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "3",
    name: "",
    title: "PRP",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "4",
    name: "",
    title: "اوزون‌تراپی",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "5",
    name: "",
    title: " لارو درمانی",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "6",
    name: "",
    title: "پانسمان نوین",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
];

const articles = [
  {
    id: "1",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "در مسیر مبارزه با سرطان، درمان هایی مانند شیمی درمانی و پرتو درمانی نقش مهمی دارند. با این حال، عوارض جانبی این درمان ها، مخصوصا مشکلات پوستی و زخم ها، می تواند چالشی بزرگ برای بیماران باشد. این عوارض اگرچه ناخوشایند هستند، اما خبر امیدوار کننده این است که به لطف پیشرفت های پزشکی، و وجود کلینیک های معتبر مانند کلینیک زخم شیراز، به طور کامل قابل مدیریت و درمان هستند. تیم تخصصی کلینیک زخم نیک، با استفاده از جدیدترین روش های جهانی، در این مسیر کنار شماست تا این چالش را با کمترین ناراحتی پشت سر بگذارید. در این مقاله قصد داریم شما را با زخم های شیمی درمانی و پرتو درمانی آشنا کنیم و روش های پیشگیری و درمان آن را توضیح دهیم. اگر شما یا اطرافیانتان دچار این مشکل هستید خواندن این مطلب می تواند برایتان مفید باشد. تا انتهای این مقاله با ما همراه باشید.",
  },
  {
    id: "2",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "در مسیر مبارزه با سرطان، درمان هایی مانند شیمی درمانی و پرتو درمانی نقش مهمی دارند. با این حال، عوارض جانبی این درمان ها، مخصوصا مشکلات پوستی و زخم ها، می تواند چالشی بزرگ برای بیماران باشد. این عوارض اگرچه ناخوشایند هستند، اما خبر امیدوار کننده این است که به لطف پیشرفت های پزشکی، و وجود کلینیک های معتبر مانند کلینیک زخم شیراز، به طور کامل قابل مدیریت و درمان هستند. تیم تخصصی کلینیک زخم نیک، با استفاده از جدیدترین روش های جهانی، در این مسیر کنار شماست تا این چالش را با کمترین ناراحتی پشت سر بگذارید. در این مقاله قصد داریم شما را با زخم های شیمی درمانی و پرتو درمانی آشنا کنیم و روش های پیشگیری و درمان آن را توضیح دهیم. اگر شما یا اطرافیانتان دچار این مشکل هستید خواندن این مطلب می تواند برایتان مفید باشد. تا انتهای این مقاله با ما همراه باشید.",
  },
  {
    id: "3",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "در مسیر مبارزه با سرطان، درمان هایی مانند شیمی درمانی و پرتو درمانی نقش مهمی دارند. با این حال، عوارض جانبی این درمان ها، مخصوصا مشکلات پوستی و زخم ها، می تواند چالشی بزرگ برای بیماران باشد. این عوارض اگرچه ناخوشایند هستند، اما خبر امیدوار کننده این است که به لطف پیشرفت های پزشکی، و وجود کلینیک های معتبر مانند کلینیک زخم شیراز، به طور کامل قابل مدیریت و درمان هستند. تیم تخصصی کلینیک زخم نیک، با استفاده از جدیدترین روش های جهانی، در این مسیر کنار شماست تا این چالش را با کمترین ناراحتی پشت سر بگذارید. در این مقاله قصد داریم شما را با زخم های شیمی درمانی و پرتو درمانی آشنا کنیم و روش های پیشگیری و درمان آن را توضیح دهیم. اگر شما یا اطرافیانتان دچار این مشکل هستید خواندن این مطلب می تواند برایتان مفید باشد. تا انتهای این مقاله با ما همراه باشید.",
  },
  {
    id: "4",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "در مسیر مبارزه با سرطان، درمان هایی مانند شیمی درمانی و پرتو درمانی نقش مهمی دارند. با این حال، عوارض جانبی این درمان ها، مخصوصا مشکلات پوستی و زخم ها، می تواند چالشی بزرگ برای بیماران باشد. این عوارض اگرچه ناخوشایند هستند، اما خبر امیدوار کننده این است که به لطف پیشرفت های پزشکی، و وجود کلینیک های معتبر مانند کلینیک زخم شیراز، به طور کامل قابل مدیریت و درمان هستند. تیم تخصصی کلینیک زخم نیک، با استفاده از جدیدترین روش های جهانی، در این مسیر کنار شماست تا این چالش را با کمترین ناراحتی پشت سر بگذارید. در این مقاله قصد داریم شما را با زخم های شیمی درمانی و پرتو درمانی آشنا کنیم و روش های پیشگیری و درمان آن را توضیح دهیم. اگر شما یا اطرافیانتان دچار این مشکل هستید خواندن این مطلب می تواند برایتان مفید باشد. تا انتهای این مقاله با ما همراه باشید.",
  },
  {
    id: "5",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "در مسیر مبارزه با سرطان، درمان هایی مانند شیمی درمانی و پرتو درمانی نقش مهمی دارند. با این حال، عوارض جانبی این درمان ها، مخصوصا مشکلات پوستی و زخم ها، می تواند چالشی بزرگ برای بیماران باشد. این عوارض اگرچه ناخوشایند هستند، اما خبر امیدوار کننده این است که به لطف پیشرفت های پزشکی، و وجود کلینیک های معتبر مانند کلینیک زخم شیراز، به طور کامل قابل مدیریت و درمان هستند. تیم تخصصی کلینیک زخم نیک، با استفاده از جدیدترین روش های جهانی، در این مسیر کنار شماست تا این چالش را با کمترین ناراحتی پشت سر بگذارید. در این مقاله قصد داریم شما را با زخم های شیمی درمانی و پرتو درمانی آشنا کنیم و روش های پیشگیری و درمان آن را توضیح دهیم. اگر شما یا اطرافیانتان دچار این مشکل هستید خواندن این مطلب می تواند برایتان مفید باشد. تا انتهای این مقاله با ما همراه باشید.",
  },
  {
    id: "6",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "در مسیر مبارزه با سرطان، درمان هایی مانند شیمی درمانی و پرتو درمانی نقش مهمی دارند. با این حال، عوارض جانبی این درمان ها، مخصوصا مشکلات پوستی و زخم ها، می تواند چالشی بزرگ برای بیماران باشد. این عوارض اگرچه ناخوشایند هستند، اما خبر امیدوار کننده این است که به لطف پیشرفت های پزشکی، و وجود کلینیک های معتبر مانند کلینیک زخم شیراز، به طور کامل قابل مدیریت و درمان هستند. تیم تخصصی کلینیک زخم نیک، با استفاده از جدیدترین روش های جهانی، در این مسیر کنار شماست تا این چالش را با کمترین ناراحتی پشت سر بگذارید. در این مقاله قصد داریم شما را با زخم های شیمی درمانی و پرتو درمانی آشنا کنیم و روش های پیشگیری و درمان آن را توضیح دهیم. اگر شما یا اطرافیانتان دچار این مشکل هستید خواندن این مطلب می تواند برایتان مفید باشد. تا انتهای این مقاله با ما همراه باشید.",
  },
];

const sampleWounds = [
  {
    id: "1",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    commentNum: "3",
    title: "زخم عفونی عمیق کف پا دختر 15 ساله",
    Introduction:
      "دختری 15 ساله با ناهنجاری مادرزادی پای چماقی که با یک زخم عفونی عمیق کف پا در پای چپش مواجه شده بود که زندگی اجتماعی و رفتن به مدرسه را برای او مختل کرده بود. اندازه زخم 60 میلی متر در 40 میلی متر با عمق حدود 30 میلی متر بود. پس از 20 جلسه مدیریت زخم در کلینیک زخم نیک شامل کنترل عفونت، دبریدمان، پانسمان مدرن، کفش آفلودینگ و وکیوم تراپی، زخم به طور کامل بهبود یافت. اکنون او خوشحال است زیرا می تواند به مدرسه برگردد و با دوستانش بازی کند",
  },
  {
    id: "2",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    commentNum: "3",
    title: "زخم عفونی عمیق کف پا دختر 15 ساله",
    Introduction:
      "دختری 15 ساله با ناهنجاری مادرزادی پای چماقی که با یک زخم عفونی عمیق کف پا در پای چپش مواجه شده بود که زندگی اجتماعی و رفتن به مدرسه را برای او مختل کرده بود. اندازه زخم 60 میلی متر در 40 میلی متر با عمق حدود 30 میلی متر بود. پس از 20 جلسه مدیریت زخم در کلینیک زخم نیک شامل کنترل عفونت، دبریدمان، پانسمان مدرن، کفش آفلودینگ و وکیوم تراپی، زخم به طور کامل بهبود یافت. اکنون او خوشحال است زیرا می تواند به مدرسه برگردد و با دوستانش بازی کند",
  },
  {
    id: "3",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    commentNum: "3",
    title: "زخم عفونی عمیق کف پا دختر 15 ساله",
    Introduction:
      "دختری 15 ساله با ناهنجاری مادرزادی پای چماقی که با یک زخم عفونی عمیق کف پا در پای چپش مواجه شده بود که زندگی اجتماعی و رفتن به مدرسه را برای او مختل کرده بود. اندازه زخم 60 میلی متر در 40 میلی متر با عمق حدود 30 میلی متر بود. پس از 20 جلسه مدیریت زخم در کلینیک زخم نیک شامل کنترل عفونت، دبریدمان، پانسمان مدرن، کفش آفلودینگ و وکیوم تراپی، زخم به طور کامل بهبود یافت. اکنون او خوشحال است زیرا می تواند به مدرسه برگردد و با دوستانش بازی کند",
  },
];
const DataConstext = createContext({ methodData, articles, sampleWounds });

export const DataProvider = ({ children }) => {
  return (
    <DataConstext.Provider value={{ methodData, articles, sampleWounds }}>
      {children}
    </DataConstext.Provider>
  );
};

export const useData = () => useContext(DataConstext);
