"use client";

import { createContext, useContext } from "react";

const methodData = [
  {
    id: "1",
    name: "",
    title: "وکیوم‌تراپی",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "2",
    name: "",
    title: " لیزر و نوردرمانی",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "3",
    name: "",
    title: "PRP",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "4",
    name: "",
    title: "اوزون‌تراپی",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "5",
    name: "",
    title: " لارو درمانی",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    usedOf: [
      "زخم ناشی از عفونت محل جراحی",
      "زخم فشاری مثل زخم بستر",
      "زخم های شریانی",
      "زخم پای دیابت",
    ],
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
  {
    id: "6",
    name: "",
    title: "پانسمان نوین",
    explain:
      "وکیوم تراپی زخم یکی از روش های درمان زخم در کلینیک زخم شیراز نیک است که در آن  از فشار منفی (Negative Pressure) کنترل شده برای تسریع روند بهبودی زخم های حاد، مزمن و سوختگی استفاده می‌شود. اعمال فشار منفی، با افزایش جریان خون در محل زخم  و کشیدن ترشحات از زخم موجب بهبودی سریع تر زخم میشود. بسته به نوع و محل تشکیل زخم، این فشار منفی  به صورت دائمی و یا تناوبی به زخم اعمال خواهد شد.",
    howWork:
      "در این شیوه درمانی از فیلم شفاف همراه با یک فوم استریل استفاده می‌شود. فوم استریل به اندازه زخم بریده شده و بر روی زخم قرار می‌گیرد. این فوم همانند یک فیلتر، در مقابل لخته های خون عمل می‌کند. فیلم شفاف لایه نفود ناپذیزی نسبت به آب را در اطراف زخم به وجود می‌آورد. به پانسمان، پمپی متصل است که تنظیم این پمپ و میزان فشار منفی اعمال شده باید توسط کارشناس زخم انجام شود. پانسمان باید هر ۲ تا 7 روز بسته به شرایط و میزان ترشح زخم تعویض شود.",
    img: "/images/aboutclinic.jpg",
    benefits: [
      "موجب تسریع روند درمان زخم میشود",
      "موجب کاهش بار میکروبی زخم میشود",
      "تعداد دفعات تعویض پانسمان را کاهش میدهد",
      "جریان خون را به محل زخم افزایش داده و همزمان ترشحات و اگزودا زخم را بیرون میکشد",
    ],
  },
];

const articles = [
  {
    id: "1",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "پسوریازیس یک بیماری خودایمنی مزمن است که پوست را تحت تاثیر قرار می‌دهد. این بیماری معمولاً به صورت لکه‌های قرمز، پوسته‌پوسته و التهاب‌دار روی پوست ظاهر می‌شود. پسوریازیس به دلیل سرعت زیاد تقسیم سلول‌های پوستی، به شکل ناهنجار رشد کرده و باعث ایجاد ضایعاتی می‌شود که می‌تواند در هر نقطه‌ای از بدن، از جمله پوست سر، آرنج‌ها و زانوها، بروز کند. در این مقاله به بررسی علل، علائم و جدیدترین روش‌های درمانی بیماری پسوریازیس می‌پردازیم. تا انتهای این مطلب با کلینیک دیابت در شیراز نیک همراه شوید.",
  },
  {
    id: "1",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "پسوریازیس یک بیماری خودایمنی مزمن است که پوست را تحت تاثیر قرار می‌دهد. این بیماری معمولاً به صورت لکه‌های قرمز، پوسته‌پوسته و التهاب‌دار روی پوست ظاهر می‌شود. پسوریازیس به دلیل سرعت زیاد تقسیم سلول‌های پوستی، به شکل ناهنجار رشد کرده و باعث ایجاد ضایعاتی می‌شود که می‌تواند در هر نقطه‌ای از بدن، از جمله پوست سر، آرنج‌ها و زانوها، بروز کند. در این مقاله به بررسی علل، علائم و جدیدترین روش‌های درمانی بیماری پسوریازیس می‌پردازیم. تا انتهای این مطلب با کلینیک دیابت در شیراز نیک همراه شوید.",
  },
  {
    id: "1",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "پسوریازیس یک بیماری خودایمنی مزمن است که پوست را تحت تاثیر قرار می‌دهد. این بیماری معمولاً به صورت لکه‌های قرمز، پوسته‌پوسته و التهاب‌دار روی پوست ظاهر می‌شود. پسوریازیس به دلیل سرعت زیاد تقسیم سلول‌های پوستی، به شکل ناهنجار رشد کرده و باعث ایجاد ضایعاتی می‌شود که می‌تواند در هر نقطه‌ای از بدن، از جمله پوست سر، آرنج‌ها و زانوها، بروز کند. در این مقاله به بررسی علل، علائم و جدیدترین روش‌های درمانی بیماری پسوریازیس می‌پردازیم. تا انتهای این مطلب با کلینیک دیابت در شیراز نیک همراه شوید.",
  },
  {
    id: "1",
    imgSrc: "/images/article.jpg",
    date: "22 مهر",
    time: "زمان مطالعه : 8 دقیقه",
    title: "پیشگیری و درمان زخم های شیمی درمانی و پرتو درمانی",
    Introduction:
      "پسوریازیس یک بیماری خودایمنی مزمن است که پوست را تحت تاثیر قرار می‌دهد. این بیماری معمولاً به صورت لکه‌های قرمز، پوسته‌پوسته و التهاب‌دار روی پوست ظاهر می‌شود. پسوریازیس به دلیل سرعت زیاد تقسیم سلول‌های پوستی، به شکل ناهنجار رشد کرده و باعث ایجاد ضایعاتی می‌شود که می‌تواند در هر نقطه‌ای از بدن، از جمله پوست سر، آرنج‌ها و زانوها، بروز کند. در این مقاله به بررسی علل، علائم و جدیدترین روش‌های درمانی بیماری پسوریازیس می‌پردازیم. تا انتهای این مطلب با کلینیک دیابت در شیراز نیک همراه شوید.",
  },
];

const DataConstext = createContext({ methodData, articles });

export const DataProvider = ({ children }) => {
  return (
    <DataConstext.Provider value={{ methodData, articles }}>
      {" "}
      {children}
    </DataConstext.Provider>
  );
};

export const useData = () => useContext(DataConstext);
